Vladimir-Trufanov/ittve-ESP32-CAM/05-CameraDachServer/CameraDachServer/app_httpd.cpp
/** Arduino, ESP32, C/C++ *********************************** app_httpd.cpp ***
 * 
 * Построить работу сервера потока изображений
 * 
 * v4.0.1, 03.03.2026                                 Автор:      Труфанов В.Е.
 * Copyright © 2026 tve                               Дата создания: 26.02.2026
 * 
**/
#include "arduino.h"

#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"

/*
    ARDUINO_ARCH_ESP32 — макрос, который определяется при компиляции с использованием 
  ядра ESP32 для Arduino. Он указывает на то, что плата — на базе микроконтроллера ESP32. 
  Макрос одинаков для всех чипов ESP32-x, например, нет ARDUINO_ARCH_ESP32_S2. 
    Макрос ARDUINO_ARCH_ESP32 используется в коде для проверки, что плата — ESP32. 
    Однако есть и ограничение: макрос ARDUINO_ARCH_ESP32 не определяется при работе 
  с ESP-IDF и arduino-esp32 как компонентом в других средах разработки. 

    CONFIG_ARDUHAL_ESP_LOG — параметр, который влияет на работу библиотеки логирования в Arduino ESP32. 
  Библиотека логирования в ESP-IDF поддерживает разные уровни детализации событий, и для каждого уровня 
  есть специальный макрос. Некоторые уровни: 
    ESP_LOGE — ошибка (минимальный уровень);
    ESP_LOGW — предупреждение;
    ESP_LOGI — информация;
    ESP_LOGD — отладочные сообщения;
    ESP_LOGV — всё подряд (максимальный уровень).
  ESP32 Arduino Core поддерживает макросы ESP-IDF, но переопределяет их, например, 

  Во время компиляции — опция CONFIG_LOG_DEFAULT_LEVEL устанавливает уровень детализации по умолчанию. 
  Также можно установить максимальный уровень детализации с помощью опции CONFIG_LOG_MAXIMUM_LEVEL. 
  По умолчанию это то же самое, что и CONFIG_LOG_DEFAULT_LEVEL, но его можно установить выше, 
  чтобы добавить в прошивку больше необязательных сообщений.
    Можно переопределить уровень детализации по умолчанию для отдельных модулей или файлов, 
  используя макрос LOG_LOCAL_LEVEL. Его можно определить прямо в файле перед подключением esp_log.h.
  Во время выполнения — все журналы для уровней детализации ниже CONFIG_LOG_DEFAULT_LEVEL включены по умолчанию. 
  Для установки уровня детализации для каждого модуля отдельно можно использовать функцию esp_log_level_set().
    Эта функция не может поднять уровень журнала выше уровня, установленного с помощью параметра CONFIG_LOG_MAXIMUM_LEVEL в menuconfig. 
  В некоторых случаях использование параметра CONFIG_ARDUHAL_ESP_LOG может вызывать ошибки, 
  например, при компиляции некоторых библиотек для ESP32. В этом случае рекомендуется проверить, 
  определено ли CONFIG_ARDUHAL_ESP_LOG, и, если нет, определить его.

  ARDUHAL_LOG_LEVEL — макрос, который определяет уровень ведения журнала в Arduino ESP32. 
  Он переопределяет макросы ESP-IDF, которые поддерживают пять уровней: 
    ARDUHAL_LOG_LEVEL_NONE — нет вывода журнала;
    ARDUHAL_LOG_LEVEL_ERROR — критические ошибки, модуль программного обеспечения не может восстановиться самостоятельно;
    ARDUHAL_LOG_LEVEL_WARN — предупреждение;
    ARDUHAL_LOG_LEVEL_INFO — информация;
    ARDUHAL_LOG_LEVEL_DEBUG — отладка;
    ARDUHAL_LOG_LEVEL_VERBOSE — подробное ведение журнала.
  По умолчанию уровень ведения журнала в Arduino ESP32 установлен на ARDUHAL_LOG_LEVEL_NONE. 
  Уровень ведения журнала можно настроить: 
    во время компиляции — с помощью опции CORE_DEBUG_LEVEL. Например, можно указать CORE_DEBUG_LEVEL=5. 
  Для PlatformIO — через опцию build_flags = -DCORE_DEBUG_LEVEL=5; 
    во время выполнения — с помощью функции esp_log_level_set. Можно установить уровень глобально 
  или для конкретного модуля (идентификатора). Модули идентифицируются тегами — строками ASCII с 
  нулевым завершением. Например, чтобы установить уровень ведения журнала на ERROR для всех компонентов, 
  нужно вызвать esp_log_level_set("*", ESP_LOG_ERROR). 
    Для конкретного файла источника — с помощью определения LOG_LOCAL_LEVEL. Оно позволяет переопределить 
  максимальный уровень ведения журнала для конкретного файла без изменения опций Kconfig. 
  Например, в файле my_file.c можно определить LOG_LOCAL_LEVEL ESP_LOG_VERBOSE перед включением esp_log.h. 
  Важно: не добавлять LOG_LOCAL_LEVEL в файлы заголовков — это может не работать 
  из-за подхода однократного включения, используемого в файлах заголовков. 

  В некоторых случаях настройка уровня ведения журнала не работает. Например: 
  esp_log_level_set() не изменяет уровень — в этом случае может потребоваться перестроить библиотеки.
  Журналы печатаются только для одного уровня — например, для log_e(), а не для других уровней (log_d(), 
  log_w(), log_i()). В этом случае нужно определить CORE_DEBUG_LEVEL как флаг сборки в файле platformio.ini.
 
  Важно: Arduino использует свои функции ведения журнала, и ESP_LOG работает только для IDF 
  (и действует на уже скомпилированные библиотеки). Вместо ESP_LOGx() в Arduino ESP32 
  используются функции log_x(). 

  ARDUHAL_LOG_LEVEL_INFO — это уровень ведения журнала в платформе ESP32. 
  Уровень ведения журнала определяет серьёзность сообщения. Некоторые значения уровней:
  ESP_LOG_NONE — нет вывода журнала;
  ESP_LOG_ERROR — критические ошибки, модуль программного обеспечения не может восстановиться самостоятельно;
  ESP_LOG_WARN — условия ошибок, из которых были приняты меры по восстановлению;
  ESP_LOG_INFO — сообщения информации, которые описывают нормальный поток событий;
  ESP_LOG_DEBUG — дополнительная информация, которая не необходима для нормального использования (значения, указатели, размеры и т. д.).
  
  Уровни ведения журнала настраиваются отдельно для приложения и загрузчика. 
  Это позволяет разработчикам применять разные настройки ведения журнала для каждого из них с помощью опций Kconfig. 

  Настроить уровень журнала в ESP32 можно двумя способами: во время компиляции и во время выполнения. 
  Во время компиляции:
  В menuconfig установить уровень детализации с помощью опции CONFIG_LOG_DEFAULT_LEVEL (уровень по умолчанию).
  При желании также в menuconfig установить максимальный уровень детализации с помощью опции CONFIG_LOG_MAXIMUM_LEVEL.
  По умолчанию это то же самое, что и CONFIG_LOG_DEFAULT_LEVEL, но его можно установить выше, 
  чтобы добавить в прошивку больше необязательных сообщений.
  Можно переопределить уровень детализации по умолчанию для отдельных модулей или файлов, 
  используя макрос LOG_LOCAL_LEVEL. Его можно определить прямо в файле перед подключением esp_log.h.
 
  Во время выполнения:
  Все журналы для уровней детализации ниже CONFIG_LOG_DEFAULT_LEVEL включены по умолчанию.
  Для установки уровня детализации для каждого модуля отдельно можно использовать функцию esp_log_level_set(). 
  Для этого используется тег.

  Важно учитывать, что эта функция не может поднять уровень журнала выше уровня, 
  установленного с помощью параметра CONFIG_LOG_MAXIMUM_LEVEL в menuconfig. 
*/

