Vladimir-Trufanov/ittve-ESP32-CAM/05-CameraDachServer/CameraDachServer/app_httpd.cpp
  if (parse_get(req, &buf) != ESP_OK) 
  {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf,"var",variable,sizeof(variable)) != ESP_OK || httpd_query_key_value(buf,"val",value,sizeof(value)) != ESP_OK) 
  {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);
  
  /*
  sensor_t * s = esp_camera_sensor_get();
  
  // Яркость
  s->set_brightness(s, 0);     // -2 to 2 - яркость
  // Уровень яркости - под это значение подстраивается выдержка затвора. 
  // Меньшие значения дают тёмную картинку, большие — светлую.
  s->set_ae_level(s, 0);       // -2 to 2
  
  s->set_contrast(s, 0);       // -2 to 2
  s->set_saturation(s, 0);     // -2 to 2
  s->set_special_effect(s, 0); // 0 to 6 (0 - No Effect, 1 - Negative, 2 - Grayscale, 3 - Red Tint, 4 - Green Tint, 5 - Blue Tint, 6 - Sepia)
  // Устанавливаем белый баланс (AWB)
  s->set_whitebal(s, 1);       // 0 = disable , 1 = enable
  // Включаем/отключаем режимы белого баланса (AWB)
  s->set_awb_gain(s, 1);       // 0 = disable , 1 = enable 
  // Устанавливаем режим белого баланса
  s->set_wb_mode(s, 0);        // 0 to 4 (if awb_gain enabled) => (0-Auto,1-Sunny,2-Cloudy,3-Office,4-Home)
  
  s->set_exposure_ctrl(s, 1);  // 0 = disable , 1 = enable
  s->set_aec2(s, 0);           // 0 = disable , 1 = enable
  s->set_aec_value(s, 300);    // 0 to 1200
  s->set_gain_ctrl(s, 1);      // 0 = disable , 1 = enable
  s->set_agc_gain(s, 0);       // 0 to 30
  s->set_gainceiling(s, (gainceiling_t)0);  // 0 to 6
  s->set_bpc(s, 0);            // 0 = disable , 1 = enable
  s->set_wpc(s, 1);            // 0 = disable , 1 = enable
  s->set_raw_gma(s, 1);        // 0 = disable , 1 = enable
  s->set_lenc(s, 1);           // 0 = disable , 1 = enable
  s->set_hmirror(s, 0);        // 0 = disable , 1 = enable
  s->set_vflip(s, 0);          // 0 = disable , 1 = enable
  s->set_dcw(s, 1);            // 0 = disable , 1 = enable
  s->set_colorbar(s, 0);       // 0 = disable , 1 = enable
  */

  int val = atoi(value);
  log_i("%s = %d", variable, val);
  sensor_t *s = esp_camera_sensor_get();
  int res = 0;

  if (!strcmp(variable, "framesize")) 
  {
    if (s->pixformat == PIXFORMAT_JPEG) 
    {
      res = s->set_framesize(s, (framesize_t)val);
    }
  } 
  else if (!strcmp(variable, "quality")) 
  {
    res = s->set_quality(s, val);
  } 
  else if (!strcmp(variable, "contrast")) 
  {
    res = s->set_contrast(s, val);
  } 
  // Яркость
  else if (!strcmp(variable, "brightness")) 
  {
    res = s->set_brightness(s, val);
  } 
  // AE Level - уровень яркости
  else if (!strcmp(variable, "ae_level")) 
  {
    res = s->set_ae_level(s, val);
  }
  else if (!strcmp(variable, "saturation")) 
  {
    res = s->set_saturation(s, val);
  } 
  else if (!strcmp(variable, "gainceiling")) 
  {
    res = s->set_gainceiling(s, (gainceiling_t)val);
  } 
  else if (!strcmp(variable, "colorbar")) 
  {
    res = s->set_colorbar(s, val);
  } 
  // Устанавливаем белый баланс (AWB)
  else if (!strcmp(variable, "awb")) 
  {
    res = s->set_whitebal(s, val);
  } 
  // Включаем/отключаем режимы белого баланса 
  else if (!strcmp(variable, "awb_gain")) 
  {
    res = s->set_awb_gain(s, val);
  } 
  // Устанавливаем режим белого баланса
  else if (!strcmp(variable, "wb_mode")) 
  {
    res = s->set_wb_mode(s, val);
  } 
  else if (!strcmp(variable, "agc")) 
  {
    res = s->set_gain_ctrl(s, val);
  } 
  else if (!strcmp(variable, "aec")) 
  {
    res = s->set_exposure_ctrl(s, val);
  } 
  else if (!strcmp(variable, "hmirror")) 
  {
    res = s->set_hmirror(s, val);
  } 
  else if (!strcmp(variable, "vflip")) 
  {
    res = s->set_vflip(s, val);
  } 
  else if 
  (!strcmp(variable, "agc_gain")) 
  {
    res = s->set_agc_gain(s, val);
  } 
  else if (!strcmp(variable, "aec_value")) 
  {
    res = s->set_aec_value(s, val);
  } 
  else if (!strcmp(variable, "aec2")) 
  {
    res = s->set_aec2(s, val);
  } 
  else if (!strcmp(variable, "dcw")) 
  {
    res = s->set_dcw(s, val);
  } 
  else if (!strcmp(variable, "bpc")) 
  {
    res = s->set_bpc(s, val);
  } 
  else if (!strcmp(variable, "wpc")) 
  {
    res = s->set_wpc(s, val);
  } 
  else if (!strcmp(variable, "raw_gma")) 
  {
    res = s->set_raw_gma(s, val);
  } 
  else if (!strcmp(variable, "lenc")) 
  {
    res = s->set_lenc(s, val);
  } 
  else if (!strcmp(variable, "special_effect")) 
  {
    res = s->set_special_effect(s, val);
  }
  else 
  {
    log_i("Unknown command: %s", variable);
    res = -1;
  }

  if (res < 0) 
  {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}
// ****************************************************************************
// *                      Выбрать значение регистра OV2640                    *
// ****************************************************************************
/* 
Метод get_reg(s, reg, mask) у структуры sensor_t — это функция, которая позволяет 
читать значение регистра датчика, например, в контексте ESP32-камеры. 
Метод реализован в драйвере датчика, например, в файле ov2640.c, где:
  s — указатель на структуру управления датчиком, которую можно получить с помощью 
функции esp_camera_sensor_get();
  reg — адрес регистра;
  mask — маска, которая используется, если нужно изменить только определённые биты
регистра. Например, если задать маску 0xFF, изменится весь регистр, а 0x00 не изменит ничего. 
Результат метода — значение регистра. Если значение не найдено, метод возвращает -1. 

[esp32-cam_ov2640-timelapse](https://github.com/raduprv/esp32-cam_ov2640-timelapse/blob/main/ov2640_timelapse_github.ino)
s->set_reg(s,0xd3,0xff,0x8); // clock
s->set_reg(s,0x11,0xff,0x0); // frame rate
*/
static int print_reg(char *p, sensor_t *s, uint16_t reg, uint32_t mask) 
{
  return sprintf(p, "\"0x%x\":%u,", reg, s->get_reg(s, reg, mask));
}
// ****************************************************************************
// *     По запросу сервера передать один раз параметры потока изображений    *
// *          на экране управления в начале сессии главной страницы           *
// ****************************************************************************
static esp_err_t status_handler(httpd_req_t *req) 
{
  // Резервируем json-строку с параметрами потока изображений
  static char json_response[1024];
  // Выбираем ссылку на параметры камеры
  sensor_t *s = esp_camera_sensor_get();
  // Формируем json-строку для передачи серверу
  char *p = json_response;
  *p++ = '{';
  
